# Работа с файлами
# для связки файла с файловыми переменными используются операторы
# a -  открытие для добавления файла
# r- открытие для чтения файла
# w - открытие для записи данных

# пример в коде
# exit()
# colors =['red', 'green', 'blue'] # есть набор данных
# data= open('file.txt', 'a') #  создали текстовую переменную data и связали ее с текстовым файлом, в (путь к файлу и модификатор)
# data.writelines(colors) # функционал для записи данных
# data.close() # закрытие файла(разрыв подключения с файлом)

# Функции и модули

# Функция-фрагмент программы, используемый многократно, нужны для переиспользования кода

# Котреж-  не изменяемый список

# (a)= (3,4)
# print(a) 
# print(a[0]) #обращение к индексу элемента







