#Задача 2 Найдите сумму цифр трехзначного числа



with open('file.txt', 'w', encoding='utf8') as file:
    file.write('первая строка в этом')

    with open('file.txt', 'r', encoding='utf8') as fd:
        z = fd.read()
        print(z)